/*  Αρχείο: a23f3.c
    Φοιτητής: Ευστάθιος Ιωσηφίδης
    ΑΜ: iis21027

    Να γραφεί πρόγραμμα το οποίο ζητά από τον χρήστη έναν θετικό ακέραιο (int) (> 0) και έπειτα αν ο ακέραιος είναι άρτιος (ζυγός)
    εμφανίζει στην οθόνη την αύξουσα ακολουθία του αριθμού από το 0 με βήμα 2, ενώ αν ο ακέραιος είναι περιττός (μονός) εμφανίζει
    στην οθόνη την αύξουσα ακολουθία του αριθμού από το 1 με βήμα 2.
    Θεωρείστε ότι ο χρήστης θα δώσει πάντα ένα θετικό ακέραιο (δεν απαιτείται έλεγχος).
    */

#include <stdio.h>
#include <math.h>
#include "simpio.h"
#include "genlib.h"

int main()
{
    int N, i;


    printf("Enter number: ");
    N=GetInteger();

    if ( N%2 == 0)
    {
    	for (i=0 ; i<=N ; i+=2)
    	{
    		printf("%d  ",i);
    	}

    }
    else
    {
    for (i=1 ; i<=N ; i+=2)
    	{
    		printf("%d  ",i);
    	}
    }

    return 0;

}



