//Υπερκλάση που περιλαμβάνει τόσο το BankAccount όσο και το Student
//Επειδή φτιάχνω abstract μέθοδο, πρέπει να έχω και abstract κλάση

//OCP ΑΡΧΗ ΑΝΟΙΚΤΗΣ-ΚΛΕΙΣΤΗΣ ΣΧΕΔΙΑΣΗΣ: είναι ανοικτό σε επέκταση κώδικα πχ προσθήκη κλάσης,
//αλλά είναι κλειστό σε τροποποιήσεις στον υπάρχοντα κώδικα πχ της main σε if, for κλπ

//Αρχή αντιστροφής εξαρτήσεων

//public abstract class Measurable_old {
	
//	// Αφηρημένη χωρίς υλοποίηση μέθοδος άρα κάνω αφηρημένη και την κλάση
//	public abstract double getMeasure();

//}
