/*  Αρχείο: a16f7.c
    Φοιτητής: Ευστάθιος Ιωσηφίδης
    ΑΜ: iis21027

    Άδεια χρήσης: GNU General Public License v3.0

    Να γραφεί ένα πρόγραμμα το οποίο θα δέχεται ένα αλφαριθμητικό μέχρι 99 χαρακτήρες
    (θα δηλώσετε ένα πίνακα 100 χαρακτήρων) και να εμφανίζει τα ψηφία που περιέχονται
    μέσα στο αλφαριθμητικό και το άθροισμά τους, όπως φαίνεται στα παραδείγματα που ακολουθούν.
    Αν δεν υπάρχει ψηφίο, τότε εμφανίζεται το μήνυμα "No digits in input".

*/

#include <stdio.h>
#include <string.h>
#include <ctype.h>

#define N 100 /* Σταθερά για πίνακα 100 χαρακτήρων */

int main()
{
/* Δήλωση και αρχικοποίηση μεταβλητών */
    char table[N];
    int i,digits=0,sum=0,numbers[N];

/* Εισαγωγή δεδομένων */
    printf("Insert a string: ");
//	fgets(table, N, stdin); /* Δουλεύει μια χαρά αλλά δεν την έχουμε δει στο μάθημα */
	gets(table); /* Με την gets διαμαρτύρεται ο compiler ενώ με την fgets είναι μια χαρά.*/

/* Ανατρέχω τον πίνακα για έλεγχος εάν υπάρχουν ψηφία */
    for (i=0;table[i]!='\0';i++)
    {
       if(table[i]>='0' && table[i]<='9')/* Ελέγχω εάν ο χαρακτήρας του πίνακα είναι ψηφίο (γίνεται και με το isdigit) */
       {
           sum+=table[i]-48; /* Αφού το μετατρέψω σε αριθμό, το προσθέτω στον αθροιστή */
           numbers[digits]=table[i]-48; /* Μετατρέπω σε αριθμό και αποθηκεύω σε έναν πίνακα για εύκολη εμφάνιση */
           digits++; /* Μετράω πόσα ψηφία για να έχω για τη θέση στον numbers και αργότερα για να δω αν εχει ψηφία */
       }
    }

/* Εκτύπωση αποτελεσμάτων */
    if(digits==0)
        {printf("No digits in input.");}/* Εάν δεν έχει κανένα ψηφίο, τότε εκτυπώνει το μήνυμα */
    /* Εκτυπώνει το ψηφίο + ψηφίο = αποτέλεσμα (sum) */
    else
    {
      for(i=0;i<digits-1;i++)
      {
          printf("%d + ",numbers[i]); /* Εκτυπώνει τον πίνακα αριθμοί από το 0 έως τον προτελευταίο */
      }
      printf("%d = %d",numbers[digits-1],sum); /* Εκτυπώνει τον τελευταίο αριθμό του πίνακα καθώς και τον αθροιστή των αριθμών */
    }

return 0;
}
