/*  Αρχείο: a29f4.c
    Φοιτητής: Ευστάθιος Ιωσηφίδης
    ΑΜ: iis21027

    Υλοποιείστε τις αντίστοιχες συναρτήσεις στην γλώσσα C των ακόλουθων μαθηματικών ορισμών:
   • Ο μέγιστος κοινός διαιρέτης (gdc) δύο μη αρνητικών ακεραίων δίνεται από τον ακόλουθο αναδρομικό ορισμό:
	gcd (a , b)= a , εάν b=0
	gcd (a , b)= gcd ( b , a % b), αλλιώς

   • Δυο ακέραιοι αριθμοί λέγονται σχετικά πρώτοι (coprime) αν ο μέγιστος κοινός διαιρέτης τους είναι το 1.
   • Η συνάρτηση φ του Euler (phi) ενός θετικού ακεραίου Ν είναι το πλήθος των θετικών ακεραίων αριθμών μικρότερων
   ή ίσων του Ν, οι οποίοι είναι σχετικά πρώτοι με το Ν (δηλαδή οι ακέραιοι Κ με 1 <= Κ <= Ν).
   Να υλοποιήσετε ένα πρόγραμμα σε C, το οποίο ζητά από τον χρήστη ένα ακέραιο Χ και εμφανίζει τις τιμές της συνάρτησης φ
   του Euler από το 1 μέχρι και τον αριθμό X. Θεωρείστε ότι ο χρήστης δίνει πάντα αριθμό μεγαλύτερο ή ίσο του 1 - δεν απαιτείται έλεγχος.
   Η εμφάνιση των μηνυμάτων θα γίνεται μέσω του κυρίως προγράμματος (συνάρτηση main(), δηλαδή η εντολή εμφάνισης των μηνυμάτων (printf)
   θα είναι στην main()).
    */

#include <stdio.h>
#include "simpio.h"
#include "genlib.h"

int gcd(int a, int b);
int phi(int n);
int coprime(int i, int x);

int main()
{
   int x, i;
   printf("Enter X: ");
   x=GetInteger();
   for(i = 1; i <= x; i++)
        printf("phi (%d) = %d\n", i, phi(i));

    return 0;

}

int gcd(int a, int b)
{

  if (b==0) return a;
  else return gcd(b,a%b);
}

int coprime(int i, int x)
{ return gcd(i,x);}

int phi(int N)
{
    int result = 0;
    int K;
    for(K = 1; K <= N; K++)
    	if (coprime(K,N) == 1)
           result ++;
    return result;
}
