/*  Αρχείο: a5f4.c
    Φοιτητής: Ευστάθιος Ιωσηφίδης
    ΑΜ: iis21027

    Οι αριθμοί για τους οποίους το άθροισμα των κύβων των ψηφίων τους είναι ίσο με τον ίδιο τον αριθμό λέγονται αριθμοί Αrmstrong
    (π.χ. 153 = 1^3 +5^3 +3^3 ). Να γραφεί πρόγραμμα που θα περιλαμβάνει τα παρακάτω:
     την συνάρτηση Sum_Cube που θα δέχεται έναν ακέραιο αριθμό (μεταξύ του 1 και του 999) και θα επιστρέφει το άθροισμα των κύβων
    των ψηφίων του.
     την συνάρτηση IsArmstrong που θα δέχεται έναν ακέραιο αριθμό και θα επιστρέφει την τιμή TRUE ή FALSE ανάλογα με το αν ο αριθμός
    είναι Αrmstrong ή όχι αντίστοιχα.
    Το κυρίως πρόγραμμα θα βρίσκει και θα εμφανίζει ποιοι είναι αριθμοί Αrmstrong στο διάστημα (1-999).
    */

#include <stdio.h>
#include <math.h>
#include "simpio.h"
#include "genlib.h"

int Sum_Cube(int num); // Δήλωση συνάρτησης Sum_Cube 
bool IsArmstrong(int x); // Δήλωση συνάρτησης IsArmstrong

int main()
{
    int i;
    for (i=1 ; i<=999; i++)
    {
    	if ( IsArmstrong(i) ) // Έλεγχος εάν είναι TRUE ή FALSE
    	{
    	printf("%d\n",i); // Εκτύπωση του i
    	}
    }
    return 0;

}

int Sum_Cube(int num)
{
	int dig3, dig2, dig1;

	dig3 = num / 100; // Απομόνωση εκατοντάδων
	dig2 = (num % 100) /10; // Απομόνωση δεκάδων
	dig1 = num % 10; // Απομώνωση μονάδων

	return pow(dig3,3)+pow(dig2,3)+pow(dig1,3); // Επιστροφή αθροίσματος κύβων
}

bool IsArmstrong(int x)
{
	return (x == Sum_Cube(x)); // Συγκρίνει αν το x είναι ίσο με το άθροισμα των ψηφίων υψωμένων στον κύβο (συνάρτηση Sum_Cube)
}
